# RbsElecPanelTotalloadLightParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecPanelTotalloadLightParam Property
ParameterTypeId Class See Also
---
"Lighting Total Connected"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecPanelTotalloadLightParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecPanelTotalloadLightParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecPanelTotalloadLightParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace